app/Controllers/Login_controller.php

    public function autenticar()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuarioModel = new \App\Models\UsuarioModel();
        $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'guadalupe@gmail.com'
 LIMIT 1

    public function verificar()
    {
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $usuarioModel = new \App\Models\UsuarioModel();
    $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'karina@gmail.com'
 LIMIT 1