app/Controllers/UsuarioController.php

    public function index()
    {
    $usuarioModel = new \App\Models\UsuarioModel();
    $datos['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `usuarios`

    public function guardar()
    {
        $usuarioModel = new UsuarioModel();

        $data = [
            'nombre'     => $this->request->getVar('nombre'),
            'email'      => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
        ];

        $usuarioModel->save($data);
---
INSERT INTO `usuarios` (`nombre`, `email`, `created_at`, `updated_at`) VALUES ('karina', 'karina@gmail.com', '2025-06-22 21:35:38', '2025-06-22 21:35:38')

    public function crear()
    {
    $usuarioModel = new \App\Models\UsuarioModel();

    $data = [
        'nombre'   => $this->request->getPost('nombre'),
        'email'    => $this->request->getPost('email'),
        'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        'rol'      => $this->request->getPost('rol'),
        'activo'   => $this->request->getPost('activo')
    ];

    $usuarioModel->insert($data);
---
INSERT INTO `usuarios` (`nombre`, `email`, `password`, `rol`, `activo`, `created_at`, `updated_at`) VALUES ('luis', 'luis@gmail.com', '$2y$10$7ZgYKxXLKf0nb.XKgkQUIODolilabPH2GsjzsVyveOSu3RX7J3/QW', 'admin', '1', '2025-06-29 23:07:10', '2025-06-29 23:07:10')

    public function editar($id)
    {
    $usuarioModel = new \App\Models\UsuarioModel();
    $usuario = $usuarioModel->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '31'